{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point, currently with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including mobile menu, dark mode toggle, hero video section, AI shade scanner, and product grid with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose and functionality in the GlamAI Makeup application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode CSS variables for the design system.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and root div mounting point.",
  "frontend/src/App.tsx": "Root React component managing routing between Home and ShadeScanner pages, with mobile menu, cart drawer, theme provider, and navigation state.",
  "frontend/src/components/AIShadeScanner.tsx": "AI shade scanner component with image upload, simulated analysis with loading state, and personalized makeup shade recommendations display.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer from right side with item list, quantity controls, remove functionality, total calculation, and WhatsApp checkout button.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, current year, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Sticky header with hamburger menu button, logo, app title, theme toggle (moon/sun icon), and cart icon with item count badge.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with video background, gradient overlay, and call-to-action buttons for shopping and AI scanner. Displays main tagline about AI-powered beauty and shade matching.",
  "frontend/src/components/MobileMenu.tsx": "Slide-out mobile navigation menu with overlay, displaying navigation items (Home, AI Shade Scanner) and logo. Handles menu open/close state and page navigation.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, and price with a hover-activated 'Quick Add' button that adds items to cart and shows toast notification.",
  "frontend/src/components/ProductGrid.tsx": "Grid layout displaying three featured products (foundation, lip gloss, eyeliner) with section heading and description. Maps over hardcoded product array to render ProductCard components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store for shopping cart state management with persistence. Handles adding, removing, updating quantities, clearing cart, and calculating total price.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for React Query hooks that interact with the backend. Contains commented example structure for future AI shade analysis mutation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, accent, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/Home.tsx": "Home page component combining HeroSection, features section with three benefit cards (AI-Powered, Premium Quality, Fast Delivery), and ProductGrid. Includes smooth scroll to products functionality.",
  "frontend/src/pages/ShadeScanner.tsx": "Page component for the AI Shade Scanner feature with header, instructions, and integration of the AIShadeScanner component. Displays a step-by-step guide explaining how users upload photos to receive AI-powered makeup shade recommendations.",
  "frontend/src/utils/whatsapp.ts": "Utility function that generates WhatsApp Web links with pre-formatted order messages containing cart items, quantities, prices, and total amount for checkout via WhatsApp number 918709162269.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, dark mode support, custom animations, border radius variables, and typography/container-queries/animate plugins.",
  "project_state.json": "Project metadata file documenting the makeup e-commerce website's architecture, features (mobile navigation, theme toggle, video hero, AI shade scanner, cart, WhatsApp checkout), and image requirements for product photos and branding."
}