{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined yet.",
  "feature_evidence.json": "Feature evidence report documenting the real-time product search bar feature, listing the files it touches, components used, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions, serving as a reference summary for all frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the GlamAI Makeup app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing page routing between Home and ShadeScanner, and controlling visibility of the mobile menu and cart drawer within a ThemeProvider.",
  "frontend/src/components/AIShadeScanner.tsx": "Component for uploading a face photo and simulating an AI skin-shade analysis, displaying a randomly selected shade name and description after a 2.5-second delay.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in right-side drawer showing cart items with quantity controls, item removal, total price, and a WhatsApp checkout button.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright year and a branded attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Sticky header containing a hamburger menu, logo, centered real-time search input backed by the useSearch Zustand store, theme toggle, and cart icon with item count badge.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with a video background, gradient overlay, and CTA buttons for 'Shop Now' and 'Try AI Scanner'.",
  "frontend/src/components/MobileMenu.tsx": "Slide-in mobile navigation drawer with Home and AI Shade Scanner links, an overlay backdrop, and active page highlighting.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying an image, name, and price with a hover-reveal 'Quick Add' button that adds the item to the cart via Zustand.",
  "frontend/src/components/ProductGrid.tsx": "Displays a grid of hardcoded makeup products filtered by the global search query, with an empty-state message when no results match.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using the current Internet Identity or an anonymous identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store with localStorage persistence managing cart items, quantities, and total price with add, remove, update, and clear actions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook wrapping DFINITY's AuthClient to manage Internet Identity login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserving space for React Query hooks that will interact with the backend once the analyzeShadeFromImage method is implemented.",
  "frontend/src/hooks/useSearch.ts": "Minimal Zustand store holding a global search query string and a setter function used to filter products.",
  "frontend/src/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom properties for the design system's color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/Home.tsx": "Home page component that renders the HeroSection, a features section with three icon cards (AI-Powered, Premium Quality, Fast Delivery), and the ProductGrid anchored by an id for smooth scrolling.",
  "frontend/src/pages/ShadeScanner.tsx": "ShadeScanner page that wraps the AIShadeScanner component with a header, descriptive intro text, and a numbered 'How It Works' explainer section.",
  "frontend/src/utils/whatsapp.ts": "Utility that builds a formatted WhatsApp wa.me link pre-filled with order details (item names, quantities, prices, and total) for the GlamAI checkout flow.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, container settings, border radius, font family, accordion keyframes, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state manifest (version 5) summarizing all implemented features, architectural notes, and known issues for the GlamAI makeup e-commerce site."
}