{
  "kind": "build_request",
  "title": "Add header search bar with real-time product grid filtering",
  "projectName": "GlamAI Makeup",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add a search bar in the Header component, positioned near the hamburger menu button, that allows users to type product names. As the user types, the product grid on the Home page filters in real-time to show only matching products from the three available products (Foundation, Lip Gloss, Eyeliner). The search is case-insensitive and matches partial product names. If no products match, display a friendly 'No products found' message in the product grid area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-9",
          "msg-10"
        ],
        "quotes": [
          "Search bar कहाँ दिखाई दे? — Header में, hamburger menu के पास",
          "Search कैसे काम करे? — product name से search हो (Foundation, Lip Gloss, Eyeliner)",
          "Search results कहाँ दिखें? — Same page पर product grid filter हो जाए"
        ]
      },
      "acceptanceCriteria": [
        "A search input field is visible in the Header, near the hamburger menu button",
        "The search bar is responsive and works on both mobile and desktop layouts",
        "Typing 'Foundation' filters the product grid to show only the Foundation product card",
        "Typing 'lip' (case-insensitive) filters the product grid to show only the Lip Gloss product card",
        "Clearing the search input restores all three product cards in the grid",
        "If the search query matches no product names, a 'No products found' message is displayed in the product grid area",
        "The search state is shared/lifted so that the Header search input controls the ProductGrid filter on the Home page",
        "The search bar styling is consistent with the existing dark/light mode theme"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths",
    "Search filtering must work client-side only — no backend changes required",
    "The three products (Foundation, Lip Gloss, Eyeliner) remain hardcoded in ProductGrid as they currently are"
  ],
  "nonGoals": [
    "Adding category or price filters",
    "Adding a separate search results page",
    "Connecting search to the backend",
    "Changing the existing cart, WhatsApp checkout, or AI Shade Scanner functionality"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}