{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add header search bar with real-time product grid filtering",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Add a search bar in the Header component near the hamburger menu that filters the product grid on the Home page in real-time based on user input, matching product names case-insensitively",
      "acceptanceCriteria": [
        "A search input field is visible in the Header, near the hamburger menu button",
        "The search bar is responsive and works on both mobile and desktop layouts",
        "Typing 'Foundation' filters the product grid to show only the Foundation product card",
        "Typing 'lip' (case-insensitive) filters the product grid to show only the Lip Gloss product card",
        "Clearing the search input restores all three product cards in the grid",
        "If the search query matches no product names, a 'No products found' message is displayed in the product grid area",
        "The search state is shared/lifted so that the Header search input controls the ProductGrid filter on the Home page",
        "The search bar styling is consistent with the existing dark/light mode theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSearch.ts",
          "operation": "create",
          "description": "Create a Zustand store for managing the global search query state. Export useSearch hook that provides searchQuery string and setSearchQuery function to allow Header and ProductGrid components to share search state."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a search input field positioned between the hamburger menu button and the logo. Import and use the useSearch hook to bind the input value to searchQuery and update it on change. Style the input to match the existing theme with appropriate padding, border, and dark mode support. Ensure responsive layout adjustments for mobile and desktop."
        },
        {
          "path": "frontend/src/components/ProductGrid.tsx",
          "operation": "modify",
          "description": "Import and use the useSearch hook to access searchQuery. Filter the hardcoded products array based on whether each product name includes the searchQuery (case-insensitive). If the filtered array is empty, render a centered 'No products found' message instead of the product cards. Maintain the existing grid layout and section heading."
        }
      ]
    }
  ]
}